Repository: Softcatala/translation-memory-tools
Catalog: latest-memories/tmx/drupal-tm.tmx
Source language: en
Languages: ca_es

source: Remember to double-check each line for syntax and logic errors <strong>before</strong> saving.
ca_es: Recordeu-vos de comprovar exhaustivament si hi ha cap error de sintaxi o de lògica a cada línia <strong>abans</strong> de desar-ho.

source: Statements must be correctly terminated with semicolons.
ca_es: Les sentències han d'acabar correctament amb punts i coma.

source: Global variables used within your PHP code retain their values after your script executes.
ca_es: Les variables globals utilitzades dins del vostre codi PHP retindran els seus valors després d'executar el guió.

source: <code>register_globals</code> is <strong>turned off</strong>. If you need to use forms, understand and use the functions in <a href="@formapi">the Drupal Form API</a>.
ca_es: <code>register globals</code> està <strong>desactivat</strong>. Si necessiteu fer servir formularis, utilitzeu i estudieu les funcions de la <a href="@formapi">API de formularis de Drupal</a>.

source: Use a <code>print</code> or <code>return</code> statement in your code to output content.
ca_es: Utilitzeu una sentència <code>print</code> o <code>echo</code> en el vostre codi per imprimir contingut.

source: Develop and test your PHP code using a separate test script and sample database before deploying on a production site.
ca_es: Desenvolupeu i comproveu el vostre codi PHP utilitzant un guió i una base de dades de proves separats abans d'incorporar-ho al web de producció.

source: Consider including your custom PHP code within a site-specific module or <code>template.php</code> file rather than embedding it directly into a post or block.
ca_es: Considereu la possibilitat d'incloure el vostre codi PHP dins d'un mòdul específic o un fitxer<code>template.php</code> en lloc d'inserir-lo directament en un enviament o bloc.

source: Be aware that the ability to embed PHP code within content is provided by the PHP Filter module. If this module is disabled or deleted, then blocks and posts with embedded PHP may display, rather than execute, the PHP code.
ca_es: Tingueu present que l'opció d'inserir codi PHP dins del contingut la proporciona el mòdul de filtre PHP. Si aquest mòdul està inhabilitat o esborrat, els blocs i enviaments amb codi PHP inserit poden mostrar-lo en lloc d'executar-lo.

source: A basic example: <em>Creating a "Welcome" block that greets visitors with a simple message.</em>
ca_es: Un exemple bàsic: <em>Crear un bloc de "Benvinguda" que saluda els visitants amb un missatge senzill.</em>

source: PHP evaluator
ca_es: Avaluador de PHP

source: Executes a piece of PHP code. The usage of this filter should be restricted to administrators only!
ca_es: Executa una peça de codi PHP. L'ús d'aquest filtre hauria d'estar restingit només als administradors!

source: Allows embedded PHP code/snippets to be evaluated.
ca_es: Permet avaluar codi/fragments PHP incrustats.

source: Total votes: @votes
ca_es: Vots totals: @votes

source: Most recent poll
ca_es: Enquesta més recent

source: A <em>poll</em> is a question with a set of possible responses. A <em>poll</em>, once created, automatically provides a simple running count of the number of votes received for each response.
ca_es: Una <em>enquesta</em> és una pregunta amb un conjunt de respostes possibles. Un cop creada, l'<em>enquesta</em> dóna automàticament un compte continu del nombre de vots rebuts per a cada resposta.

source: Poll status
ca_es: Estat de l'enquesta

source: When a poll is closed, visitors can no longer vote for it.
ca_es: Quan una enquesta està tancada els visitants no poden votar-hi més.

source: After this period, the poll will be closed automatically.
ca_es: Després d'aquest període l'enquesta es tancarà automàticament.

source: Negative values are not allowed.
ca_es: Els valors negatius no es permeten.

source: Your vote could not be recorded because you did not select any of the choices.
ca_es: El vostre vot no s'ha pogut registrar perquè no heu escollit cap opció.

source: Vote count
ca_es: Recompte de vots

source: Polls
ca_es: Enquestes

source: Profile fields have been updated.
ca_es: Els camps del perfil han estat actualitzats.

source: No fields in this category. If this category remains empty when saved, it will be removed.
ca_es: No hi ha camps en aquesta categoria. Si continua buida en desar-la, s'esborrarà.

source: edit %title
ca_es: edita %title

source: add new %type
ca_es: afegeix un nou %type

source: The name of the field. The form name is not shown to the user but used internally in the HTML code and URLs. Unless you know what you are doing, it is highly recommended that you prefix the form name with <code>profile_</code> to avoid name clashes with other fields. Spaces or any other special characters except dash (-) and underscore (_) are not allowed. An example name is "profile_favorite_color" or perhaps just "profile_color".
ca_es: El nom del camp. El nom del formulari no és mostrarà a l'usuari però és fa servir en el codi HTML i en els URL. A menys que sapigueu que esteu fent, és altament recomanable que prefixeu el nom del formulari amb <code>profile_</code> per evitar col·lisions de noms amb altres camps. Els espais o altres caràcters especials excepte el guió (-) i el subratllat (_) no estan permesos. Un exemple de nom és "profile_favorite_color" o potser només "profile_color".

source: A list of all options. Put each option on a separate line. Example options are "red", "blue", "green", etc.
ca_es: Una llista amb totes les opcions. Poseu cada opció en una línia independent. Alguns exemples d'opcions: "negre", "blau", "verd", etc.

source: Hidden profile field, only accessible by administrators, modules and themes.
ca_es: Camp ocult del perfil. Només poden accedir a ell els administradors, els mòduls i els temes.

source: Private field, content only available to privileged users.
ca_es: Camp privat, el contingut només és disponible als usuaris privilegiats.

source: Public field, content shown on profile page but not used on member list pages.
ca_es: Camp públic, el contingut es mostra a la pàgina del perfil, però no s'utilitza a les pàgines de llistat de membres.

source: Public field, content shown on profile page and on member list pages.
ca_es: Camp públic, el contingut es mostra a la pàgina del perfil i a les pàgines de llistat de membres.

source: The weights define the order in which the form fields are shown. Lighter fields "float up" towards the top of the category.
ca_es: Els pesos defineixen l'ordre en el que es mostraran els camps. Els camps més lleugers "flotaran" cap a la part superior de la categoria.

source: Form will auto-complete while user is typing.
ca_es: El formulari autocompletarà mentre l'usuari està escrivint.

source: For security, auto-complete will be disabled if the user does not have access to user profiles.
ca_es: Per seguretat, l'autocompletat es deshabilitarà si l'usuari no té accés als perfils d'usuari.

source: The specified form name contains one or more illegal characters. Spaces or any other special characters except dash (-) and underscore (_) are not allowed.
ca_es: El nom de formulari especificat conté un o més caràcters prohibits. No es permeten espais o qualsevol altre caràcter especial excepte els guions (-) i guions baixos (_).

source: The specified form name is reserved for use by Drupal.
ca_es: El nom de camp especificat està reservat per a l'ús de Drupal.

source: The specified category name is reserved for use by Drupal.
ca_es: El nom de categoria especificat està reservat per a l'ús de Drupal.

source: The specified title is already in use.
ca_es: El títol especificat ja està en ús.

source: The specified name is already in use.
ca_es: El nom especificat ja està en ús.

source: A hidden field cannot be required.
ca_es: Un camp ocult no pot ser obligatori.

source: A hidden field cannot be set to visible on the user registration form.
ca_es: Un camp ocult no es pot definir com a visible al formulari de registre de l'usuari.

source: The field has been created.
ca_es: S'ha actualitzat el camp.

source: Are you sure you want to delete the field %field?
ca_es: Esteu segur de voler esborrar el camp %field?

source: This action cannot be undone. If users have entered values into this field in their profile, these entries will also be deleted. If you want to keep the user-entered data, instead of deleting the field you may wish to <a href="@edit-field">edit this field</a> and change it to a hidden profile field so that it may only be accessed by administrators.
ca_es: Aquesta acció no es pot desfer. Si els usuaris han entrat valors en aquest camp al seu perfil, aquestes entrades també seran suprimides. Si voleu mantenir les dades introduïdes pels usuaris, enlloc de suprimir el camp podeu <a href="@edit-field">editar-lo</a> i canviar-lo per un camp ocult del perfil que només hi podran accedir els administradors.

source: The field %field has been deleted.
ca_es: S'ha suprimit el camp %field.

source: Profile field %field added under category %category.
ca_es: El camp %field del perfil s'ha afegit a la categoria %category.

source: Profile field %field deleted.
ca_es: El perfil del camp %field s'ha suprimit.

source: User list
ca_es: Llista d'usuaris

source: single-line textfield
ca_es: camp de text d'una línia

source: multi-line textfield
ca_es: camp de text de múltiples línies

source: checkbox
ca_es: quadre de comprovació

source: list selection
ca_es: selecció de llista

source: freeform list
ca_es: llista de formularis lliures

source: Author information
ca_es: Informació de l'autor

source: Link to full user profile
ca_es: Enllaça al perfil complet de l'usuari

source: Profile fields to display
ca_es: Camps de perfil a mostrar

source: Select which profile fields you wish to display in the block. Only fields designated as public in the <a href="@profile-admin">profile field configuration</a> are available.
ca_es: Seleccioneu quins camps del perfil voleu que es mostrin en el bloc. Només els camps designats com públics a la <a href="@profile-admin">configuració del camp de perfil</a> estan disponibles.

source: View full user profile
ca_es: Veure el perfil d'usuari complet

source: About %name
ca_es: Quant a %name

source: Put each item on a separate line or separate them by commas. No HTML allowed.
ca_es: Poseu cada element en una línia distinta o separeu-los per comes. No es permet HTML.

source: The value provided for %field is not a valid URL.
ca_es: El valor proveït per %field no és un URL vàlid.

source: Create customizable fields for your users.
ca_es: Creeu camps personalitzats pels vostres usuaris.

source: Profile category autocomplete
ca_es: Autocompleta la categoria del perfil

source: Edit field
ca_es: Edita el camp

source: Delete field
ca_es: Suprimeix el camp

source: Profile autocomplete
ca_es: Autocompleta el perfil

source: Supports configurable user profiles.
ca_es: Permet l'ús de perfils d'usuari configurables.

source: The search index is not cleared but systematically updated to reflect the new settings. Searching will continue to work but new content won't be indexed until all existing content has been re-indexed. This action cannot be undone.
ca_es: L'índex de cerca no es neteja però sistemàticament s'actualitza per reflectir la nova configuració. La cerca continuarà funcionant però el nou contingut no serà indexat fins que tot el contingut s'hagi tornat a reindexar. Aquesta acció no es pot desfer.

source: The index will be rebuilt.
ca_es: L'índex es reconstruirà.

source: Indexing status
ca_es: Estat d'indexació

source: Indexing throttle
ca_es: Regulació de la indexació

source: Number of items to index per cron run
ca_es: Nombre d'elements a indexar en cada execució del cron

source: The maximum number of items indexed in each pass of a <a href="@cron">cron maintenance task</a>. If necessary, reduce the number of items to prevent timeouts and memory errors while indexing.
ca_es: El nombre màxim d'elements indexats a cada pas de la <a href="@cron">tasca de manteniment de cron</a>. Si cal, reduïu el nombre d'elements per evitar errors de temps excedit i de memòria a l'hora d'indexar.

source: Indexing settings
ca_es: Paràmetres de la indexació

source: <p><em>Changing the settings below will cause the site index to be rebuilt. The search index is not cleared but systematically updated to reflect the new settings. Searching will continue to work but new content won't be indexed until all existing content has been re-indexed.</em></p><p><em>The default settings should be appropriate for the majority of sites.</em></p>
ca_es: <p><em>Canviant les preferències de més avall forçareu la reconstrucció dels índexs del web. L'índex de cerca no s'esborra sinó que s'actualitza sistemàticament per reflectir les noves preferències. La cerca continuarà treballant però el nou contingut no serà indexat fins que tot el contingut existent s'hagi tornat a indexar.</em></p><p><em>Les preferències predeterminades són les adequades per a la gran majoria de llocs web</em></p>

source: Minimum word length to index
ca_es: Mida mínima de les paraules a indexar

source: The number of characters a word has to be to be indexed. A lower setting means better search result ranking, but also a larger database. Each search query must contain at least one keyword that is this size (or longer).
ca_es: El nombre de caràcters que ha de tenir una paraula per a que es pugui indexar. Un nombre més baix millora el rànquing de resultats, però també fa que la base de dades sigui major. Cada consulta de cerca ha de tenir, al menys, una paraula d'aquesta mida (o major).

source: Simple CJK handling
ca_es: Gestió simple CJK

source: Whether to apply a simple Chinese/Japanese/Korean tokenizer based on overlapping sequences. Turn this off if you want to use an external preprocessor for this instead. Does not affect other languages.
ca_es: On aplicar un separador sil·làbic de xinès senzill, japonès o coreà basat en seqüències que es superposen. Desactiveu-lo si voleu emprar un pre-processador extern per això. No afecta a altres idiomes.

source: The search engine maintains an index of words found in your site's content. To build and maintain this index, a correctly configured <a href="@cron">cron maintenance task</a> is required. Indexing behavior can be adjusted using the settings below.
ca_es: El motor de cerca manté un índex de les paraules trobades al contingut del web. Per crear i mantenir aquest índex cal tenir la <a href="@cron">tasca de manteniment de cron</a> ben configurada. El comportament de l'índex es pot ajustar mitjançant els paràmetres següents.

source: Search form
ca_es: Formulari de cerca

source: Top search phrases
ca_es: Les frases de cerca més actives

source: View most popular search phrases.
ca_es: Visualitzeu les frases de cerca més populars.

source: Enables site-wide keyword searching.
ca_es: Habilita la cerca de paraules clau per tot el web.

source: Total page generation time
ca_es: Temps total de generació de pàgines

source: Top pages in the past %interval
ca_es: Pàgines principals dels últims %interval

source: Top visitors in the past %interval
ca_es: Visitants més actius en el passat %interval

source: Top referrers in the past %interval
ca_es: Principals referents dels últims %interval

source: Log each page access. Required for referrer statistics.
ca_es: Registre cada accés de pàgina. Es requereix per a les estadístiques de referents.

source: Older access log entries (including referrer statistics) will be automatically discarded. (Requires a correctly configured <a href="@cron">cron maintenance task</a>.)
ca_es: Les entrades més velles del registre d'accessos (incloent les estadístiques dels referenciadors) es descartaran automàticament. (requereix una <a href="@cron">tasca de manteniment de cron</a> ben configurada.)

source: Content viewing counter settings
ca_es: Paràmetres del comptador de visualització dels continguts

source: Count content views
ca_es: Compta les visualitzacions dels continguts

source: Increment a counter each time content is viewed.
ca_es: Incrementa un comptador cada vegada que es visualitza un contingut.

source: Settings for the statistical information that Drupal will keep about the site. See <a href="@statistics">site statistics</a> for the actual information.
ca_es: Els paràmetres per a la informació estadística que Drupal mantindrà per al lloc. Mireu les <a href="@statistics">estadístiques del lloc</a> per a la informació recent.</p>

source: This page displays the site's most recent hits.
ca_es: Aquesta pàgina mostra els <em>hits</em> més recents.

source: This page displays all external referrers, or external references to your website.
ca_es: Aquesta pàgina mostra tots els referenciadors, o referències externes al vostre web.

source: When you ban a visitor, you prevent the visitor's IP address from accessing your site. Unlike blocking a user, banning a visitor works even for anonymous users. This is most commonly used to block resource-intensive bots or web crawlers.
ca_es: Quan desterreu un usuari, prohibiu l'accés al web a l'adreça IP del visitant. A diferència de l'usuari bloquejat, el desterrar un usuari és fin i tot per als usuaris anònims. Això es fa servir usualment per bloquejar robots que consumeixen molts recursos o indexadors de webs.

source: Popular content
ca_es: Continguts populars

source: How many content items to display in "all time" list.
ca_es: Quants elements de contingut per mostrar en la llista "històriques".

source: How many content items to display in "recently viewed" list.
ca_es: Quants elements de contingut per mostrar en la llista "vist recentment".

source: Today's:
ca_es: D'avui:

source: All time:
ca_es: Històrics:

source: Last viewed:
ca_es: Darrera visualització:

source: View pages that have recently been visited.
ca_es: Veure les pàgines que han estat visitades recentment.

source: View pages that have been hit frequently.
ca_es: Veure pàgines que s'han accedit freqüentment.

source: Top visitors
ca_es: Visitants més actius

source: View visitors that hit many pages.
ca_es: Veure visitants que accedeixen a moltes pàgines.

source: Top referrers
ca_es: Referents més actius

source: View top referrers.
ca_es: Veure referents més actius.

source: View access log.
ca_es: Veure registre d'accés.

source: Track page visits
ca_es: Segueix les visites de la pàgina

source: Logs access statistics for your site.
ca_es: Estadístiques del registre d'accés del vostre lloc.

source: Logs and records system events to syslog.
ca_es: Registra els esdeveniments del sistema al Syslog.

source: User pictures in posts
ca_es: Imatges d'usuari en els articles

source: User pictures in comments
ca_es: Imatges d'usuari en els comentaris

source: Shortcut icon
ca_es: Icona drecera

source: Logo image settings
ca_es: Paràmetres de la imatge del logotip

source: If toggled on, the following logo will be displayed.
ca_es: Si es marca, el següent logotip es mostrarà.

source: Use the default logo
ca_es: Utilitza el logotip predeterminat

source: Check here if you want the theme to use the logo supplied with it.
ca_es: Activeu aquí si voleu que el tema faci servir el logotip subministrat amb ell.

source: The path to the file you would like to use as your logo file instead of the default logo.
ca_es: El camí cap al fitxer que voleu utilitzar com el vostre logotip en lloc del logotip predeterminat.

source: Upload logo image
ca_es: Carrega una imatge de logotip

source: Shortcut icon settings
ca_es: Paràmetres de la icona drecera

source: Your shortcut icon, or 'favicon', is displayed in the address bar and bookmarks of most browsers.
ca_es: La vostra icona d'accés ràpid, o 'favicon', es mostra a la barra d'adreces i a les adreces d'interès de la majoria de navegadors.

source: Use the default shortcut icon.
ca_es: Empra la icona drecera predeterminada.

source: Check here if you want the theme to use the default shortcut icon.
ca_es: Marqueu aquí si voleu que el tema utilitzi la icona drecera predeterminada.

source: The path to the image file you would like to use as your custom shortcut icon.
ca_es: El camí al fitxer de la imatge que us agradaria utilitzar com la vostra icona drecera personalitzada.

source: Upload icon image
ca_es: Carrega la icona

source: If you don't have direct file access to the server, use this field to upload your shortcut icon.
ca_es: Si no teniu accés directe als fitxers del servidor, utilitzeu aquest camp per carregar la vostra icona drecera.

source: @module (<span class="admin-missing">missing</span>)
ca_es: @module (<span class="admin-missing">falta</span>)

source: The following modules will be completely uninstalled from your site, and <em>all data from these modules will be lost</em>!
ca_es: Els següents mòduls es desinstal·laran completament del lloc i <em>totes les dades d'aquests mòduls es perdran</em>!

source: Confirm uninstall
ca_es: Confirma la desinstal·lació

source: Would you like to continue with uninstalling the above?
ca_es: Us agradaria continuar desinstal·lant-ho?

source: No modules selected.
ca_es: No hi ha mòduls seleccionats.

source: The selected modules have been uninstalled.
ca_es: Els mòduls seleccionats s'han desinstal·lat.

source: The path '@path' is either invalid or you do not have access to it.
ca_es: La ruta '@path' no és vàlida o no hi teniu accés.

source: Default 403 (access denied) page
ca_es: Pàgina predeterminada per a 403 (accés denegat)

source: Default 404 (not found) page
ca_es: Pàgina predeterminada per a 404 (no trobat)

source: Caches cleared.
ca_es: Memòries cau netejades.

source: Select an image processing toolkit
ca_es: Trieu un joc d'eines de processament d'imatges

source: Number of items in each feed
ca_es: Nombre d'elements a cada canal

source: Default number of items to include in each feed.
ca_es: Nombre d'elements a incloure a cada canal per defecte.

source: Feed content
ca_es: Contingut del canal

source: Titles plus teaser
ca_es: Títols més resums

source: Global setting for the default display of content items in each feed.
ca_es: Configuració global de com s'han de mostrar per defecte els elements de contingut de cada font.

source: Cron ran successfully.
ca_es: El cron s'ha executat amb èxit.

source: Cron run failed.
ca_es: L'execució de cron ha fallat.

source: No modules are available to uninstall.
ca_es: No hi ha mòduls disponibles per desinstal·lar.

source: This theme requires PHP version @php_required and is incompatible with PHP version !php_version.
ca_es: Aquest tema requereix la versió @php_required de PHP i és incompatible amb la versió !php_version.

source: This page shows you all available administration tasks for each module.
ca_es: Aquesta pàgina us mostra totes les tasques administratives disponibles per a cada mòdul.

source: These options control the display settings for the <code>%template</code> theme. When your site is displayed using this theme, these settings will be used. By clicking "Reset to defaults," you can choose to use the <a href="@global">global settings</a> for this theme.
ca_es: Aquestes opcions controlen els paràmetres de visualització per al tema <code>%template</code>. Quan es mostra el lloc fent servir aquest tema, s'utilitzaran aquests paràmetres. Fent clic a "reinicia als valors per defecte" podeu triar fer servir els <a href="@global">paràmetres globals</a> per aquest tema.

source: These options control the default display settings for your entire site, across all themes. Unless they have been overridden by a specific theme, these settings will be used.
ca_es: Aquestes opcions controlen els paràmetres de visualització predeterminats pel al lloc sencer, per a tots els temes. A menys que hagin estat substituïts per un tema específic, seran utilitzats aquests paràmetres.
